read_verilog -sv hdl/synth_top.sv hdl/snn_lif_bank.sv hdl/snn_lif_cell.sv hdl/snn_mac.sv hdl/snn_mac_array.sv
hierarchy -check -top compute_core
synth -top compute_core -noabc -nofsm -noalumacc
dfflibmap -liberty /home/andrew/.volare/volare/sky130/versions/0fe599b2afb6708d281543108caf8310912f54af/sky130A/libs.ref/sky130_fd_sc_hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
stat -liberty /home/andrew/.volare/volare/sky130/versions/0fe599b2afb6708d281543108caf8310912f54af/sky130A/libs.ref/sky130_fd_sc_hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
write_verilog -noattr synth/compute_core_noabc.nl.v
